fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

// Переменные для хранения состояния документа до записи
Перем ВКМ_ЭтоНовый;
Перем ВКМ_СтарыеДанные;

#КонецОбласти

#Область ОбработчикиСобытий

// 1. ПОДГОТОВКА К УВЕДОМЛЕНИЯМ (Запоминаем что было ДО записи)
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ВКМ_ЭтоНовый = ЭтоНовый();
	
	// Если документ правится, запоминаем старые значения для сравнения в ПриЗаписи
	Если Не ВКМ_ЭтоНовый Тогда
		ВКМ_СтарыеДанные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, 
			"Специалист, ДатаПроведенияРабот, ВремяНачалаРабот, ВремяОкончанияРабот");
	КонецЕсли;
	
КонецПроцедуры

// 2. РЕГИСТРАЦИЯ УВЕДОМЛЕНИЯ (Срабатывает ПОСЛЕ успешной записи в БД)
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НужноУведомить = Ложь;
	ТекстСобытия   = "";
	
	Если ВКМ_ЭтоНовый Тогда
		НужноУведомить = Истина;
		ТекстСобытия   = "Назначена новая заявка.";
	ИначеЕсли ВКМ_СтарыеДанные <> Неопределено Тогда
		// Сравниваем реквизиты из ТЗ: Специалист, Дата или Время
		Если Специалист <> ВКМ_СтарыеДанные.Специалист 
			Или ДатаПроведенияРабот <> ВКМ_СтарыеДанные.ДатаПроведенияРабот
			Или ВремяНачалаРабот <> ВКМ_СтарыеДанные.ВремяНачалаРабот
			Или ВремяОкончанияРабот <> ВКМ_СтарыеДанные.ВремяОкончанияРабот Тогда
			
			НужноУведомить = Истина;
			ТекстСобытия   = "Параметры заявки (дата/время/специалист) изменены.";
		КонецЕсли;
	КонецЕсли;
	
	Если НужноУведомить Тогда
		ВКМ_СформироватьЗаписьВТГ(ТекстСобытия);
	КонецЕсли;
	
КонецПроцедуры

// 3. ПРОВЕРКА ЗАПОЛНЕНИЯ (Твой код)
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(Договор) Тогда
		ДанныеДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, 
			"ВидДоговора, ВКМ_ДатаНачала, ВКМ_ДатаОкончания");
		
		ВидАбонент = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
		
		Если ДанныеДоговора.ВидДоговора <> ВидАбонент Тогда
			ОбщегоНазначения.СообщитьПользователю(
				"Выбранный договор не является договором абонентского обслуживания.", , "Договор", , Отказ);
		КонецЕсли;

		Если Дата < ДанныеДоговора.ВКМ_ДатаНачала Или Дата > ДанныеДоговора.ВКМ_ДатаОкончания Тогда
			ТекстОшибки = СтрШаблон("Дата документа вне периода действия договора (%1 - %2)", 
				Формат(ДанныеДоговора.ВКМ_ДатаНачала, "ДЛФ=D"), 
				Формат(ДанныеДоговора.ВКМ_ДатаОкончания, "ДЛФ=D"));
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Дата", , Отказ);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// 4. ПРОВЕДЕНИЕ (Твой код)
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;

	СтавкаЧаса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_СтоимостьЧасаРаботы");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ

		|	СУММА(ТЧ.ЧасыКОплате) КАК Часы,
		|	ЕСТЬNULL(Условия.ПроцентОтРабот, -1) КАК Процент
		|ИЗ

		|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, Сотрудник = &Специалист) КАК Условия
		|		ПО ИСТИНА

		|ГДЕ
		|	ТЧ.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО

		|	ЕСТЬNULL(Условия.ПроцентОтРабот, -1)";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Специалист", Специалист);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		
		Если Выборка.Процент = -1 Тогда
			ТекстСообщения = СтрШаблон("Для сотрудника %1 не заданы условия оплаты!", Специалист);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
			Возврат;
		КонецЕсли;

		// Движение: Клиент (Остатки)
		ДвижениеКлиент = Движения.ВКМ_ВыполненныеКлиентуРаботы.ДобавитьПриход();
		ДвижениеКлиент.Период = Дата;
		ДвижениеКлиент.Клиент = Клиент;
		ДвижениеКлиент.Договор = Договор;
		ДвижениеКлиент.КоличествоЧасов = Выборка.Часы;
		ДвижениеКлиент.СуммаКОплате = Выборка.Часы * СтавкаЧаса;

		// Движение: Сотрудник (Обороты)
		ДвижениеСотрудник = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		ДвижениеСотрудник.Период = Дата;
		ДвижениеСотрудник.Сотрудник = Специалист;
		ДвижениеСотрудник.ЧасовКОплате = Выборка.Часы;
		ДвижениеСотрудник.СуммаКОплате = (Выборка.Часы * СтавкаЧаса) * Выборка.Процент / 100;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует текст и записывает его в очередь справочника
Процедура ВКМ_СформироватьЗаписьВТГ(Знач Заголовок)
	
	ШаблонСообщения = "%1
	|Специалист: %2
	|Клиент: %3

	|Дата: %4
	|Время: %5 - %6";
	
	ТекстСообщения = СтрШаблон(ШаблонСообщения,
		Заголовок, Строка(Специалист), Строка(Клиент),
		Формат(ДатаПроведенияРабот, "ДЛФ=D"),
		Формат(ВремяНачалаРабот, "ДЛФ=T"),
		Формат(ВремяОкончанияРабот, "ДЛФ=T"));
		
	НовоеУведомление = Справочники.ВКМ_УведомленияТГБоту.СоздатьЭлемент();
	НовоеУведомление.ВКМ_ТекстСообщения = ТекстСообщения;
	НовоеУведомление.Записать();
	
КонецПроцедуры

#КонецОбласти
#КонецЕсли
